# The difference between loc & iloc in Pandas

In [1]:
import pandas as pd

In [2]:
data = [[1,2,3,4,5] , [6,7,8,9,10] , [11,12,13,14,15] , [16,17,18,19,20] , [21,22,23,24,25] ,
        [26,27,28,29,30] , [31,32,33,34,35] , [36,37,38,39,40]]
index = [1, 2, 33 , 4, 5 ,6, 7 ,8 ]
columns = ['a','b','c', 'd' , 'e']
df = pd.DataFrame(data,index,columns)
df

     a   b   c   d   e
1    1   2   3   4   5
2    6   7   8   9  10
33  11  12  13  14  15
4   16  17  18  19  20
5   21  22  23  24  25
6   26  27  28  29  30
7   31  32  33  34  35
8   36  37  38  39  40

## loc & iloc methods

In [3]:
# The loc method enables you to “locate” a row or column by its “name”.

df.loc[[1,5,6] , ['a','d','e']]

    a   d   e
1   1   4   5
5  21  24  25
6  26  29  30

In [4]:
# The iloc method enables you to “locate” a row or column by its “integer index”.
# In general integer index starts with zero unless we change it.

df.iloc[[0,4,5] , [0,3,4]]

    a   d   e
1   1   4   5
5  21  24  25
6  26  29  30

In [5]:
# with both location and ilocation in case of giving one input this input should be for a row name or index
df.loc[1]

a    1
b    2
c    3
d    4
e    5
Name: 1, dtype: int64

In [6]:
df.iloc[0]

a    1
b    2
c    3
d    4
e    5
Name: 1, dtype: int64

## Slicing

In [7]:
# The colon character ':'is used for slicing, it indicates that we want to retrieve all columns or rows 
# depending on it's place or if we put it after the row or column name or index it will retrieve all rows or columns 
# after or before the given one
df.loc[:5,'b':'e']

     b   c   d   e
1    2   3   4   5
2    7   8   9  10
33  12  13  14  15
4   17  18  19  20
5   22  23  24  25

In [8]:
df.iloc[:5 , 1:4]

     b   c   d
1    2   3   4
2    7   8   9
33  12  13  14
4   17  18  19
5   22  23  24

In [9]:
# whith slicing loc include the first up to last column or row in the output
df.loc[1:4 , "a":'d']

     a   b   c   d
1    1   2   3   4
2    6   7   8   9
33  11  12  13  14
4   16  17  18  19

In [10]:
# whith slicing iloc include first up to and excluding the last column or row in the output
df.iloc[1:4 , 1:4]

     b   c   d
2    7   8   9
33  12  13  14
4   17  18  19

In [11]:
#when we choose to give one input this input will goes for the rows and all the columns will appear in the output
df.loc[1:33]

     a   b   c   d   e
1    1   2   3   4   5
2    6   7   8   9  10
33  11  12  13  14  15

In [12]:
#when we choose to give one input this input will goes for the rows and all the columns will appear in the output
df.iloc[1:3]

     a   b   c   d   e
2    6   7   8   9  10
33  11  12  13  14  15

In [13]:
#slicing with skip coutning: we can use the colon (:) after defining the slicing range to skip counting 
#by the number we put after the colon
df.loc[1:8:3, 'a':'e':2]

    a   c   e
1   1   3   5
4  16  18  20
7  31  33  35

In [14]:
df.iloc[0:8:2, 0:5:2 ]

     a   c   e
1    1   3   5
33  11  13  15
5   21  23  25
7   31  33  35

In [15]:
# negative means counting from the end backword and it work only with iloc, loc will throuhg en error
df.iloc[-1:]

    a   b   c   d   e
8  36  37  38  39  40

## Index with loc &iloc

In [16]:
df.index[3]

4

In [17]:
df.loc[df.index[3]]

a    16
b    17
c    18
d    19
e    20
Name: 4, dtype: int64

In [18]:
df.iloc[df.index[3]]

a    21
b    22
c    23
d    24
e    25
Name: 5, dtype: int64

In [19]:
# get-loc is used to give the index of the given row
df.index.get_loc(33)

2

In [20]:
df.loc[:df.index.get_loc(33) , :'d']

   a  b  c  d
1  1  2  3  4
2  6  7  8  9

In [21]:
df.iloc[:df.index.get_loc(33) , :4]

   a  b  c  d
1  1  2  3  4
2  6  7  8  9

## Changing the value of cell with loc & iloc

In [22]:
# we can change any value in dataframe wih loc and iloc

df.loc[2, 'a'] = 400
df

      a   b   c   d   e
1     1   2   3   4   5
2   400   7   8   9  10
33   11  12  13  14  15
4    16  17  18  19  20
5    21  22  23  24  25
6    26  27  28  29  30
7    31  32  33  34  35
8    36  37  38  39  40

In [23]:
df.iloc[1, 0] = 200
df

      a   b   c   d   e
1     1   2   3   4   5
2   200   7   8   9  10
33   11  12  13  14  15
4    16  17  18  19  20
5    21  22  23  24  25
6    26  27  28  29  30
7    31  32  33  34  35
8    36  37  38  39  40

## Boolean indexing

In [24]:
# location based boolean indexing on an integer type
df.loc[df['b'] < 20, ['a', 'b', 'd']]

      a   b   d
1     1   2   4
2   200   7   9
33   11  12  14
4    16  17  19

In [25]:
#iLocation based boolean indexing on an integer type is not available
#df.iloc[df['b'] < 3, [1,4]] #this code will through an error

## True & False to choose specific rows & columns

In [26]:
# we can make a list of booleans to choose specific columns and rows that we want to retreive 
# with both  both loc & iloc to choose specific columns and rows
cols = [False,  True,  False,  True,  True]
df.loc[:, cols ]

     b   d   e
1    2   4   5
2    7   9  10
33  12  14  15
4   17  19  20
5   22  24  25
6   27  29  30
7   32  34  35
8   37  39  40

In [27]:
rows = [True,  False ,  False,  True,  True, False, True, True]
df.iloc[rows, :]

    a   b   c   d   e
1   1   2   3   4   5
4  16  17  18  19  20
5  21  22  23  24  25
7  31  32  33  34  35
8  36  37  38  39  40